tutorials/crysImpurityPBEFoam/taylor/0/C
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}

dimensions      [1 -3 0 0 0 0 0];
internalField   uniform 900;

boundaryField
{
    innerWall { type zeroGradient; }
    outerWall { type zeroGradient; }
    bottom    { type zeroGradient; }
    top       { type zeroGradient; }
    front     { type wedge; }
    back      { type wedge; }
}
