tutorials/crysImpurityPBEFoam/taylor/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 305.15;

boundaryField
{
    innerWall { type fixedValue; value uniform 305.15; }
    outerWall { type fixedValue; value uniform 305.15; }
    bottom    { type zeroGradient; }
    top       { type zeroGradient; }
    front     { type wedge; }
    back      { type wedge; }
}
