tutorials/crysImpurityPBEFoam/taylor/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    innerWall
    {
        type    rotatingWallVelocity;
        origin  (0 0 0);
        axis    (0 0 1);
        omega   52.36;
    }
    outerWall { type fixedValue; value uniform (0 0 0); }
    bottom    { type noSlip; }
    top       { type noSlip; }
    front     { type wedge; }
    back      { type wedge; }
}
