tutorials/crysImpurityPBEFoam/taylor/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    innerWall { type calculated; value uniform 0; }
    outerWall { type calculated; value uniform 0; }
    bottom    { type calculated; value uniform 0; }
    top       { type calculated; value uniform 0; }
    front     { type wedge; }
    back      { type wedge; }
}
