tutorials/crysImpurityPBEFoam/taylor/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    innerWall { type fixedFluxPressure; value uniform 0; }
    outerWall { type fixedFluxPressure; value uniform 0; }
    bottom    { type fixedFluxPressure; value uniform 0; }
    top       { type fixedFluxPressure; value uniform 0; }
    front     { type wedge; }
    back      { type wedge; }
}
