tutorials/crysImpurityPBEFoam/taylor/constant/populationBalanceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object populationBalanceProperties;
}

populationBalanceModel crysImpurityPopulationBalance;

crysImpurityPopulationBalanceCoeffs
{
    rhop        1136;
    shapeFactor 1;
    sizeRef     1.0e-4;

    speciesCoupled true;
    nucleation      true;
    growth          true;
    aggregation     false;
    breakup         false;

    saturationModel
    {
        solutionSaturationModel LlysineH2O;
    }

    diffusionModel
    {
        diffusionModel none;
    }

    growthModel
    {
        growthModel coolCrysGrowth;
        minAbscissa 1.0e-9;
        maxAbscissa 1.0e-3;
        CgGrowth CgGrowth [0 1 -1 0 0 0 0] 9.5208e-5;
        powCoeff 1.201;
    }

    nucleationModel
    {
        nucleationModel deltaNucleation;
        kb kb [0 -3 -1 0 0 0 0] 9.9596e7;
        powCoeff 0.804;
        d_nucleation 1.0e-6;
    }

    impurityCoeffs
    {
        impurityAdsorptionModel competitiveAdsorption;
        soluteField C;
        impurityField Ci;
        Ki Ki [-1 3 0 0 0 0 0] 0.5;
        Ks Ks [-1 3 0 0 0 0 0] 1.0e-3;
        eta 0.01;
        rhoi 1200;
        surfaceFactor 3.14159265359;
        zNucleation 0;
    }

    Pr 1;
    Prt 1;
    molarDiff 1.0e-5;
    Sct 0.7;

    odeCoeffs
    {
        solveSources true;
        solveOde true;
        ATol 1.0e-10;
        RTol 1.0e-6;
        fac 0.9;
        facMin 0.2;
        facMax 2;
        minLocalDt 1.0e-10;
    }
}
