tutorials/crysImpurityPBEFoam/taylor/system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object controlDict;
}

libs ("libcrystalPopuBal.so");
application crysImpurityPBEFoam;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 0.02;
deltaT 0.0005;
writeControl timeStep;
writeInterval 40;
writeFormat ascii;
writePrecision 10;
timeFormat general;
timePrecision 8;
runTimeModifiable false;
adjustTimeStep true;
maxCo 0.5;
maxDeltaT 0.0005;
